# Lesson 5 -  Solutions
These exercises are to help you check your understanding during class. They will not be collected.

## Part 1 - Set up and Sort

### Exercise 1 - Set up

There is a CSV file called `NYC_Dog_Licensing.csv` in the `~/shared/data` folder. As the name indicates, this file contains information about New York City dog licences. This data comes from the [NYC OpenData project](https://opendata.cityofnewyork.us/).

- Import the NYC Dog Licenses data using the `read.csv()` function and store it in an R data frame called `nyc_dogs`.
- Load the dplyr package by excuting the ```library('dplyr')```command. You can ignore the warnings about masked opbjects.
- Use ```mutate()``` to add a new column called `Age` to the data frame. This column should contain an approximation of each dog's age.

In [24]:
nyc_dogs <- read.csv('~/shared/data/NYC_Dog_Licensing.csv')  # add the final name and path in quotes
library('dplyr') # load the dplyr package

nyc_dogs <- mutate(nyc_dogs, Age = 2021 - AnimalBirthYear) # age is approximately current_year - birth_year
head(nyc_dogs) # view the results

  X RowNumber AnimalName AnimalGender AnimalBirthYear BreedName
1 1 34510     ESCO       F            2015            Pekingese
2 2 37953     FLAX       M            2011            Portuguese Water Dog
3 3 43865     ZOE        F            2013            Maltese
4 4 46519     CHESBAR    M            2006            Chesapeake Bay Retriever
5 5 47651     LEICA      F            2014            Old English Sheepdog
6 6 47720     TUCHA      M            2014            Rat Terrier
  Borough ZipCode LicenseIssuedDate LicenseExpiredDate Extract.Year Age
1 NA      10012   12/15/2015        2021-12-12         2016          6
2 NA      10012   01/13/2016        2021-03-05         2016         10
3 NA      10014   02/15/2016        2021-02-15         2016          8
4 NA      10012   02/29/2016        2021-04-22         2016         15
5 NA      10012   03/05/2016        2021-04-06         2016          7
6 NA      10013   03/05/2016        2021-02-24         2016          7

### Exercise 2 - Select Columns

The `nyc_dogs` data frame has a lot of columns that we wont use today. Use `select()` to prune the columns in `nyc_dogs` as described below.

Keep:
- AnimalName
- AnimalGender
- BreedName
- ZipCode
- Age

Remove:
- X
- RowNumber
- AnimalBirthYear
- Borough
- LicenseIssuedDate
- LicenseExpiredDate
- Extract.Year

Then, use the `names()` function to check that your code had the desired affect.

In [23]:
# Strategy 1
nyc_dogs <- select(nyc_dogs, AnimalName, AnimalGender, BreedName, ZipCode, Age)
names(nyc_dogs)

[1] "AnimalName"   "AnimalGender" "BreedName"    "ZipCode"      "Age"

In [25]:
# Strategy 2
nyc_dogs <- select( nyc_dogs,
        -X, 
        -RowNumber,
        -AnimalBirthYear,
        -Borough,
        -LicenseIssuedDate, 
        -LicenseExpiredDate,
        -Extract.Year
    )
# Spreading code across multiple lines can make it easier to read and prevent it being cut off in the PDF.

names(nyc_dogs)

[1] "AnimalName"   "AnimalGender" "BreedName"    "ZipCode"      "Age"

### Exercise 3 - Piping

Do the exact same thing as you did in Exercise 2, but this time use a different syntax. If you used piping in Exercise 2, use regular R syntax for this exercise. Otherwise, using piping for this exercise.

In [7]:
nyc_dogs <- nyc_dogs %>%
    select('AnimalName', 'AnimalGender', 'BreedName', 'ZipCode', 'Age')

## Part 2 - Filter

### Exercise 4 - Find the old Chihuahuas

Filter the nyc_dogs data frame to consist only of dogs are at least 10 years old and whose breed is 'Chihuahua'. Store the filtered data in a new data frame called `old_chihuahuas`. Use `head()` to check that your code had the desired affect.

In [12]:
# Strategy 1
old_chihuahuas <- filter(nyc_dogs, Age >=10 & BreedName == 'Chihuahua')
head(old_chihuahuas,2)

  AnimalName AnimalGender BreedName ZipCode Age
1 BAILEY     M            Chihuahua 10013   16
2 RUSSELL    M            Chihuahua 10014   12

In [9]:
# Strategy 2
old_chihuahuas <- filter(nyc_dogs, BreedName == 'Chihuahua')
old_chihuahuas <- filter(old_chihuahuas, Age >=10)
head(old_chihuahuas,2)

  AnimalName AnimalGender BreedName ZipCode Age
1 BAILEY     M            Chihuahua 10013   16
2 RUSSELL    M            Chihuahua 10014   12

### Exercise 5 - How many old Chihuahuas are there?
How many chihuahuas are there in the data set that are at least 10 years old?

In [13]:
# Strategy 1
nrow(old_chihuahuas) # nrow gives the number of rows in the dataframe

[1] 7

In [11]:
# Strategy 2 
dim(old_chihuahuas)[1] # [1] after dim() pulls out the first entry in the result, the number of rows.

[1] 7

In [28]:
# Strategy 3
length(old_chihuahuas$Age)

[1] 7

In [29]:
# Strategy 4
str(old_chihuahuas)

[1] 7

There are 7 chihuahuas in the data set that are at least 10 years old.

### Exercise 6 - Check your assumptions
What assumptions are underlying your answer? Is your number likely larger than, equal to, or smaller than the actual number.

This is assuming that all of the dogs in the data set are alive today. It is also assuming that all dogs born in 2011 are 10 years old. Both of these assumption will lead to an output that is **larger** than the actual number.

## Part 3 - Group and Summarize

### Exercise 7 - Where do the dogs live?

Use the ```group_by()``` and ```summarize()``` functions to answer the following questions. You can ignore the warning message about `summarise()` ungrouping output.
- How many of dogs in the nyc_dogs data set live in each zip code?

In [11]:
### Dogs per zipcode
nyc_dogs <- ungroup(nyc_dogs) # Execute this command to remove any grouping that was applied in previous exercises.
nyc_dogs <- group_by(nyc_dogs, ZipCode)
head(summarize(nyc_dogs, Count=n())) # n() says count

  ZipCode Count
1 10012   149
2 10013   149
3 10014   217

### Excercise 8 - Average age
- Use the code in the cell below to remove all groupings from nyc_dogs
- Find the average of both the female dogs and the male dogs in the nyc_dogs data frame.

In [12]:
nyc_dogs <- ungroup(nyc_dogs) # Execute this command to remove any grouping that was applied in previous exercises.

In [13]:
nyc_dogs <- group_by(nyc_dogs, AnimalGender)
summarize(nyc_dogs, AvgAge = mean(Age))

  AnimalGender AvgAge
1 F            6.473077
2 M            7.270588

### Exercise 9 - Popular name
- Find the most popular male dog name and the most popular female dog name in the nyc_dogs dataset.

In [14]:
nyc_dogs <- ungroup(nyc_dogs) # Execute this command to remove any grouping that was applied in previous exercises.
nyc_dogs <- group_by(nyc_dogs, AnimalName, AnimalGender)
name_counts <- summarize(nyc_dogs, Count = n())
name_counts <- arrange(name_counts, desc(Count))
head(name_counts)

  AnimalName AnimalGender Count
1 BANDIT     M            8
2 RUBY       F            7
3 STELLA     F            7
4 GRETA      F            6
5 LOLA       F            6
6 DAISY      F            5

The most popular male dog name is Bandit and the most popular female dog name is Ruby.

## Examples

### Example 1 - sort berkeley data

In [1]:
berkeley <- read.csv('~/shared/data/berkeley73.csv')
arrange(berkeley, desc(Women_Admitted))
rm(berkeley) # remove the variable so that it does just sit in memory.

ERROR: Error in arrange(berkeley, desc(Women_Admitted)): could not find function "arrange"

### Example 2 - Longest lived breed

Based on the data in nyc_dogs determine what breed has the longest lifespan.

In [113]:
head(arrange(nyc_dogs, desc(Age))) # Look at the data so that we know what to expect

  X   RowNumber AnimalName AnimalGender AnimalBirthYear
1 418 63866     AEON       F            2002
2 422 65005     SCOUT      M            2003
3  23 64970     BOZ        M            2004
4  29 72188     LOLA       F            2004
5  99 18491     BOZ        M            2004
6 105 21371     LOLA       F            2004
  BreedName                     Borough ZipCode LicenseIssuedDate
1 Labrador Retriever Crossbreed NA      10012   04/03/2018
2 Cavalier King Charles Spaniel NA      10013   04/09/2018
3 Labradoodle                   NA      10014   05/19/2016
4 Labrador Retriever            NA      10013   06/19/2016
5 Labradoodle                   NA      10014   05/19/2016
6 Labrador Retriever            NA      10013   06/19/2016
  LicenseExpiredDate Extract.Year Age
1 2021-04-03         2018         18
2 2023-04-09         2018         17
3 2021-05-19         2016         16
4 2021-06-19         2016         16
5 2021-05-19         2017         16
6 2021-06-19         2017         16

In [114]:
# Execute this command to remove any grouping that was applied in previous exercises.
nyc_dogs <- ungroup(nyc_dogs)

In [37]:
# Strategy 1: summarize and sort
nyc_dogs <- group_by(nyc_dogs, BreedName)
breed_age <- summarize(nyc_dogs, Max_Age = max(Age))
breed_age <- arrange(breed_age, desc(Max_Age))
head(breed_age, 3)

  BreedName                     Max_Age
1 Labrador Retriever Crossbreed 19
2 Cavalier King Charles Spaniel 18
3 Beagle Crossbreed             17

In [38]:
# Strategy 1 with piping
nyc_dogs %>% 
    group_by(BreedName) %>% 
    summarize(Max_Age = max(Age)) %>% 
    arrange(desc(Max_Age)) %>% 
    head(3)

  BreedName                     Max_Age
1 Labrador Retriever Crossbreed 19
2 Cavalier King Charles Spaniel 18
3 Beagle Crossbreed             17

We conclude that Labrador Retriever Crossbreed	is the longest lived of the breeds, because they can reach the maximum age of 18 years old.

In [35]:
# Strategy 2: Find max age then filster, summarize and sort
old_dogs <- filter(nyc_dogs, Age == max(Age))
old_dogs <- group_by(old_dogs, BreedName)
old_breeds <- summarize(old_dogs, Count = n())
old_breeds <- arrange(old_breeds, desc(Count))
head(old_breeds, 3)
rm(old_breeds)

  BreedName            Count
1 Pug                  6
2 Schnauzer, Miniature 6
3 Schnauzer Crossbreed 5

In [33]:
# Strategy 2 with piping
nyc_dogs %>% 
    filter(Age == max(Age)) %>%
    group_by(BreedName) %>%
    summarize(Count = n()) %>%
    arrange(desc(Count)) %>%
    head(3)

  BreedName            Count
1 Pug                  6
2 Schnauzer, Miniature 6
3 Schnauzer Crossbreed 5

We conclude that Labrador Retriever Crossbreed	is the longest lived of the breeds, because they can reach the maximum age of 18 years old.

### Example 3: Dogs who live to be at least 10 years old

It would be more accurage to look at the dogs who get old (say at least 10 years) rather than just those that reach the max age.

In [121]:
nyc_dogs <- ungroup(nyc_dogs) # Execute this command to remove any grouping that was applied in previous exercises.

In [50]:
# Strategy 3 Highest percentage of old dogs, in knowns breeds with at least 100 representatives
nyc_dogs <- mutate(nyc_dogs, is_old = Age >=10)
nyc_dogs <- group_by(nyc_dogs, BreedName)
breed_counts <- summarize(nyc_dogs, Total = n(), Perc_Old = sum(is_old) / Total)
breed_counts <- arrange(breed_counts,desc(Total), desc(Perc_Old))
head(breed_counts,3)

  BreedName          Total Perc_Old
1 Labrador Retriever 34    0.5294118
2 Shih Tzu           20    0.2000000
3 Labradoodle        18    0.3888889

In [49]:
# Strategy 3 with piping
nyc_dogs %>% 
    mutate(is_old = Age >=10) %>%
    group_by(BreedName) %>%
    summarize(Total = n(), Perc_Old = sum(is_old) / Total) %>%
    arrange(desc(Total), desc(Perc_Old)) %>%
    head(3)

  BreedName          Total Perc_Old
1 Labrador Retriever 34    0.5294118
2 Shih Tzu           20    0.2000000
3 Labradoodle        18    0.3888889

We conclude that Labrador Retriever is most likely to live at least ten years.